# ExportSAT

## Description
Export the selection into a ACIS SAT 3D model file.

```pascal
FUNCTION ExportSAT(
				filePath       : STRING;
				solidAsSurface : BOOLEAN): BOOLEAN;
```

```python
def vs.ExportSAT(filePath, solidAsSurface):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|filePath|STRING|Output file path.|
|solidAsSurface|BOOLEAN|   |

## Version
Availability: from Vectorworks 2013

## Category
* File I@O